#### KeynoteEntry Members

---

|  |
| --- |
| KeynoteEntry Class   Constructors   Methods   Properties   See Also |

The  KeynoteEntry  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | KeynoteEntry(String, String) | Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents. |
| Public method | KeynoteEntry(String, String, String) | Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  KeyBasedTreeEntry  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. (Inherited from  KeyBasedTreeEntry  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  KeyBasedTreeEntry  .) |
| Public property | Key | The key of this entry. (Inherited from  KeyBasedTreeEntry  .) |
| Public property | KeynoteText | The text associated with this KeynoteEntry. |
| Public property | ParentKey | The parent key of this entry. (Inherited from  KeyBasedTreeEntry  .) |

# See Also

KeynoteEntry Class

Autodesk.Revit.DB Namespace